
//Счастливые билеты
//Есть 2 способа подсчёта счастливых билетов:
//1. Простой — если на билете напечатано шестизначное число, и сумма первых трёх цифр равна сумме последних трёх, то этот билет считается счастливым.
//2. Сложный — если сумма чётных цифр билета равна сумме нечётных цифр билета, то билет считается счастливым.
//Определить программно какой вариант подсчёта счастливых билетов даст их большее количество на заданном интервале.

//Входные параметры: объект context с полями min и max
//Выход: объект с информацией о победившем методе и количестве счастливых билетов для каждого способа подсчёта.

console.log('******************')
const firstWay = function (num) {
    let firstSumm = 0;
    let secondSumm = 0;
   // if (num.lenght == 6) {
        for (i = 0; i < num; i++) {
            console.log(num)
        //}
    }
}
console.log(firstWay(235145))